#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# author:35037
# datetime:2019/4/21 10:09
import xlwt
import StyleConfig


# 当前先用函数的方式编程后面用对象方式编程
def get_style(workbook):
    xlwt.add_palette_colour('custom_colour', 0x21)
    workbook.set_colour_RGB(0x21, 114, 251, 99)
    pattern = xlwt.Pattern()
    pattern.pattern = xlwt.Pattern.SOLID_PATTERN
    pattern.pattern_fore_colour = xlwt.Style.colour_map['custom_colour']
    # pattern.pattern_back_colour
    style = xlwt.XFStyle()
    style.pattern = pattern
    return style


# 获取单元格样式
def get_cell_style(index):
    pass


# 向单元格写内容
def write_cell(worksheet, cell_content, col_indexs, row_index):
    pass


# 向每一行写内容
def write_row(worksheet, row_content, head_info):
    col_indexs = get_col_index(head_info)
    row_index = 0
    font = xlwt.Font()
    font.colour_index = 4
    font.underline = True
    style = xlwt.XFStyle()
    style.font = font

    for row in row_content:
        row_index += 1
        for col_index in col_indexs:
            if col_indexs[col_index] == 0:
                worksheet.write(row_index, col_indexs[col_index], xlwt.Formula(row.get(col_index, '')), style)
            else:
                # print(row_index, col_indexs[col_index], row.get(col_index, ''))
                worksheet.write(row_index, col_indexs[col_index], row.get(col_index, ''))


# 获取列的索引
def get_col_index(head_info):
    key_map = {}
    count = 0
    for colum in head_info.keys():
        key_map.setdefault(colum, count)
        count += 1

    return key_map


def write_head(worksheet, heads, head_style=None):
    col_num = 0
    for head in heads:
        worksheet.write(0, col_num, head)
        col_num += 1

def write_sheet(worksheet, sheet_content, head_info):
    write_head(worksheet, head_info.values())
    write_row(worksheet, sheet_content, head_info)


def write_single_excel(name, sheet_name, content, head_info):
    workbook = xlwt.Workbook(encoding='utf-8')
    style = get_style(workbook)
    worksheet = workbook.add_sheet(sheet_name)
    write_sheet(worksheet, content, head_info)
    # worksheet.write(0, 0, 'cell contents', style)
    workbook.save(name)


if __name__ == '__main__':
    head_info = {
        '1': '文件名',
        '名称': '理财产品',
        '理财计划期限|存款期限': '募集期',
        '类型': '产品类型',
        '认购期': '产品期限(天）',
        '发行规模': '计划募集规模（亿）',
        '认购起点|起存金额': '认购起点（万）',
        '本金及利息|业绩比较基准': '业绩基准（预期收益率）',
        '销售费率': '销售费率',
        '托管费率': '托管费率',
        '认购费': '认购费',
        '赎回费': '赎回费',
        '固定投资管理费率': '管理费',
        '挂钩标的': '投向资产',
        '估值方法': '估值方法',
        '风险等级': '风险等级',
        '客户类型': '客户类型',
    }
    content = [{'1': '=hyperlink("C:\\bank\\CMB\\2019-04-20-16-52-52/招商银行焦点联动系列之股票指数表现联动（沪深300看跌自动赎回结构）非保本理财计划产品说明书（产品代码：119331）.pdf","招商银行焦点联动系列之股票指数表现联动（沪深300看跌自动赎回结构）非保本理财计划产品说明书（产品代码：119331）.pdf")', '名称': '招商银行焦点联动系列之股票指数表现联动（沪深 300 看跌自动赎回结构）非保本理财计划（产品代码：119331）', '类型': '非保本理财计划', 0: '招商银行焦点联动系列之股票指数表现联动（沪深 300 看跌自动赎回结构）非保本理财计划（产品代码：119331）', '挂钩标的': '沪深300 指数（000300.SH）', 7: '沪深300 指数（000300.SH）', '认购起点|起存金额': '5 万', 1: [('', '5 万', '', '')], '认购期': '2019年4月29日-2019年4月29日', 3: [('2019 年 4 月22 日', ' 2019 年4 月29日')], '理财计划期限|存款期限': '192 天', 2: '192 天', '发行规模': '5 亿元人民币', 4: [('5 亿元人民币', '', '')], '销售费率': '0.30%/年', '托管费率': '0.02%/年', '固定投资管理费率': '0.10%/年', 5: [('销售费率 0.30%/年', '托管费率 0.02%/年', '管理费率 0.10%/年', '', '')], 8: '非保本理财计划'}, {'1': '=hyperlink("C:\\bank\\CMB\\2019-04-20-16-52-52/招商银行零售青葵系列半年定开9号理财计划产品说明书.pdf","招商银行零售青葵系列半年定开9号理财计划产品说明书.pdf")', '名称': '招商银行零售青葵系列半年定开9号理财计划（产品代码：301009）', 0: '招商银行零售青葵系列半年定开9号理财计划（产品代码：301009）', '类型': '固定收益类', 8: '固定收益类', '本金及利息|业绩比较基准': '3.60%/4.00%', 6: ['3.60%', '4.00%'], '发行规模': '10 亿', 4: [('', '', '10 亿')], '认购起点|起存金额': '1 万', 1: [('', '', '', '1 万')], '认购期': '2019年4月25日-2019年4月25日', 3: [('2019 年 4 月 22 日', ' 2019年 4 月 25 日')], '固定投资管理费率': '0.3%/年', '销售费率': '0.3%/年', '托管费率': '0.10%/年', 5: [('管理费率 0.3%/年', '销售服务费率 0.3%/年', '托管费率0.10%/年', '', '')]}, {'1': '=hyperlink("C:\\bank\\CMB\\2019-04-20-16-52-52/招商银行增利A款8号封闭式理财计划产品说明书.pdf","招商银行增利A款8号封闭式理财计划产品说明书.pdf")', '名称': '招商银行增利A款8号封闭式理财计划（产品代码：660008   ）', 0: '招商银行增利A款8号封闭式理财计划（产品代码：660008   ）', '类型': '固定收益类产品', 8: '固定收益类产品', '本金及利息|业绩比较基准': '4.10%/4.50%', 6: ['4.10%', '4.50%'], '发行规模': '10亿', 4: [('', '', '10亿')], '认购起点|起存金额': '1万', 1: [('', '', '', '1万')], '认购期': '2019年4月29日-2019年4月29日', 3: [('2019年4月23日', '2019年4月29日')], '固定投资管理费率': '0.2%/年', '销售费率': '0.3%/年', '托管费率': '0.10%/年', 5: [('管理费率0.2%/年', '销售服务费率0.3%/年', '托管费率0.10%/年', '', '')]}, {'1': '=hyperlink("C:\\bank\\CMB\\2019-04-20-16-52-52/招商银行焦点联动系列之股票指数表现联动（沪深300欧式看涨价差结构）非保本理财计划产品说明书（产品代码：119332）.pdf","招商银行焦点联动系列之股票指数表现联动（沪深300欧式看涨价差结构）非保本理财计划产品说明书（产品代码：119332）.pdf")', '名称': '招商银行焦点联动系列之股票指数表现联动（沪深300 欧式看涨价差结构）非保本理财计划（产品代码：119332）', '类型': '非保本理财计划', 0: '招商银行焦点联动系列之股票指数表现联动（沪深300 欧式看涨价差结构）非保本理财计划（产品代码：119332）', '挂钩标的': '沪深300 指数（000300.SH）', 7: '沪深300 指数（000300.SH）', '认购起点|起存金额': '5 万', 1: [('', '5 万', '', '')], '认购期': '2019年4月30日-2019年4月30日', 3: [('2019 年4 月23 日', '2019 年4 月 30日')], '理财计划期限|存款期限': '43 天', 2: '43 天', '发行规模': '5 亿元人民币', 4: [('5 亿元人民币', '', '')], '销售费率': '0.30%/年', '托管费率': '0.02%/年', '固定投资管理费率': '0.10%/年', 5: [('销售费率0.30%/年', '托管费率0.02%/年', '管理费率 0.10%/年', '', '')], 8: '非保本理财计划'}, {'1': '=hyperlink("C:\\bank\\CMB\\2019-04-20-16-52-52/招商银行焦点联动系列之股票指数表现联动（沪深300欧式看跌价差结构）非保本理财计划产品说明书（产品代码：119333）.pdf","招商银行焦点联动系列之股票指数表现联动（沪深300欧式看跌价差结构）非保本理财计划产品说明书（产品代码：119333）.pdf")', '名称': '招商银行焦点联动系列之股票指数表现联动（沪深300 欧式看跌价差结构）非保本理财计划（产品代码：119333）', '类型': '非保本理财计划', 0: '招商银行焦点联动系列之股票指数表现联动（沪深300 欧式看跌价差结构）非保本理财计划（产品代码：119333）', '挂钩标的': '沪深300 指数（000300.SH）', 7: '沪深300 指数（000300.SH）', '认购起点|起存金额': '5 万', 1: [('', '5 万', '', '')], '认购期': '2019年4月30日-2019年4月30日', 3: [('2019 年4 月23 日', '2019 年4 月 30日')], '理财计划期限|存款期限': '43 天', 2: '43 天', '发行规模': '5 亿元人民币', 4: [('5 亿元人民币', '', '')], '销售费率': '0.30%/年', '托管费率': '0.02%/年', '固定投资管理费率': '0.10%/年', 5: [('销售费率0.30%/年', '托管费率0.02%/年', '管理费率 0.10%/年', '', '')], 8: '非保本理财计划'}]
    write_single_excel('test.xls', 'test3', content, head_info)
